run/cylinderSimulation_3d/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (5.000000e-01 0.000000e+00 0.000000e+00) // 0
    (3.061617e-17 5.000000e-01 0.000000e+00) // 1
    (-5.000000e-01 6.123234e-17 0.000000e+00) // 2
    (-9.184851e-17 -5.000000e-01 0.000000e+00) // 3
    (3.500000e-01 0.000000e+00 0.000000e+00) // 4
    (2.143132e-17 3.500000e-01 0.000000e+00) // 5
    (-3.500000e-01 4.286264e-17 0.000000e+00) // 6
    (-6.429396e-17 -3.500000e-01 0.000000e+00) // 7
    (5.000000e-01 0.000000e+00 5.000000e+00) // 8
    (3.061617e-17 5.000000e-01 5.000000e+00) // 9
    (-5.000000e-01 6.123234e-17 5.000000e+00) // 10
    (-9.184851e-17 -5.000000e-01 5.000000e+00) // 11
    (3.500000e-01 0.000000e+00 5.000000e+00) // 12
    (2.143132e-17 3.500000e-01 5.000000e+00) // 13
    (-3.500000e-01 4.286264e-17 5.000000e+00) // 14
    (-6.429396e-17 -3.500000e-01 5.000000e+00) // 15
);

blocks
(
hex (0 1 5 4 8 9 13 12) porosity (20 20 142)  edgeGrading (1.000000 1.000000 1.000000 1.000000 5.000000 5.000000 5.000000 5.000000 1.000000 1.000000 1.000000 1.000000)
hex (1 2 6 5 9 10 14 13) porosity (20 20 142)  edgeGrading (1.000000 1.000000 1.000000 1.000000 5.000000 5.000000 5.000000 5.000000 1.000000 1.000000 1.000000 1.000000)
hex (2 3 7 6 10 11 15 14) porosity (20 20 142)  edgeGrading (1.000000 1.000000 1.000000 1.000000 5.000000 5.000000 5.000000 5.000000 1.000000 1.000000 1.000000 1.000000)
hex (3 0 4 7 11 8 12 15) porosity (20 20 142)  edgeGrading (1.000000 1.000000 1.000000 1.000000 5.000000 5.000000 5.000000 5.000000 1.000000 1.000000 1.000000 1.000000)
hex (4 5 6 7 12 13 14 15) porosity (20 20 142)  edgeGrading (1.000000 1.000000 1.000000 1.000000 1.000000 1.000000 1.000000 1.000000 1.000000 1.000000 1.000000 1.000000)
);

edges
(
arc 0 1 (3.535534e-01 3.535534e-01 0.000000e+00) 
arc 1 2 (-3.535534e-01 3.535534e-01 0.000000e+00) 
arc 2 3 (-3.535534e-01 -3.535534e-01 0.000000e+00) 
arc 3 0 (3.535534e-01 -3.535534e-01 0.000000e+00) 
arc 4 5 (1.944544e-01 1.944544e-01 0.000000e+00) 
arc 5 6 (-1.944544e-01 1.944544e-01 0.000000e+00) 
arc 6 7 (-1.944544e-01 -1.944544e-01 0.000000e+00) 
arc 7 4 (1.944544e-01 -1.944544e-01 0.000000e+00) 
arc 8 9 (3.535534e-01 3.535534e-01 5.000000e+00) 
arc 9 10 (-3.535534e-01 3.535534e-01 5.000000e+00) 
arc 10 11 (-3.535534e-01 -3.535534e-01 5.000000e+00) 
arc 11 8 (3.535534e-01 -3.535534e-01 5.000000e+00) 
arc 12 13 (1.944544e-01 1.944544e-01 5.000000e+00) 
arc 13 14 (-1.944544e-01 1.944544e-01 5.000000e+00) 
arc 14 15 (-1.944544e-01 -1.944544e-01 5.000000e+00) 
arc 15 12 (1.944544e-01 -1.944544e-01 5.000000e+00) 
);

boundary
(
   bottom
   {
       type patch;
       faces
       (
       (1 0 4 5)
       (2 1 5 6)
       (3 2 6 7)
       (0 3 7 4)
       (5 4 7 6)
       );
   }
   walls
   {
      type wall;
      faces
      (
      (0 1 9 8)
      (1 2 10 9)
      (2 3 11 10)
      (3 0 8 11)
      );
   }
   top
   {
      type patch;
      faces
      (
      (8 9 13 12)
      (9 10 14 13)
      (10 11 15 14)
      (11 8 12 15)
      (12 13 14 15)
      );
   }
);

mergePatchPairs
(
);

