run/cylinderSimulation_3d/system/FOwriteRhoField
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

writeObjects
{
    type            writeObjects;
    libs            ("libutilityFunctionObjects.so");
    objects         (rho);
    writeControl    writeTime;
}

// ************************************************************************* //
